Autodesk.Revit.DB.ScheduleSheetInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ,System.Int32)
Creates an instance of a schedule segment on a sheet.
Remarks:
The segment index value could be -1, which means to create an instance for the entire schedule,
see Autodesk.Revit.DB.ScheduleSheetInstance.SegmentIndex property for more details.
document:
The document
viewSheetId:
The id of the sheet where the schedule segment will be placed.
scheduleId:
The id of the schedule view.
origin:
Location on the sheet where the schedule segment will be placed.
segmentIndex:
The schedule segment index of the schedule instance.
Returns:
The new ScheduleInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
scheduleId is not a ViewSchedule that can be added to sheets. "Internal" schedules are not user-visible but are filtered by sheet or used to manage Revisions, which cannot be added to sheets.
-or-
viewSheetId is not a ViewSheet.
-or-
segmentIndex is not a valid segment index.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2022.1

Autodesk.Revit.DB.ScheduleSheetInstance.Create(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.XYZ)
Create an instance of a schedule on a sheet.
document:
The document
viewSheetId:
The id of the sheet where the schedule will be placed.
scheduleId:
The id of the schedule view.
origin:
Location on the sheet where the schedule will be placed.
Returns:
The new ScheduleInstance.
Throws Autodesk.Revit.Exceptions.ArgumentException:
scheduleId is not a ViewSchedule that can be added to sheets. "Internal" schedules are not user-visible but are filtered by sheet or used to manage Revisions, which cannot be added to sheets.
-or-
viewSheetId is not a ViewSheet.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance.SegmentIndex
The schedule segment index of this ScheduleSheetInstance.
Remarks:
This property represents which schedule segment is referred to by this ScheduleSheetInstance. It normally starts with 0 and
is less than the total number of the schedule segments, but there're some speccial cases:
The segment index value could be -1, which means referring to the whole schedule but not a specific segment.The segment index value 0 should be considered the same as -1 if the referenced schedule is not split in normal cases.The segment index value must be 0 if the schedule is a revision schedule and in a family.The segment index value can't be modified if the schedule is filter by sheet. (In fact, The segment
is referenced to is belongs to an internal schedule that only valid in the current view in this case.)
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: segmentIndex is not a valid segment index.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: The schedule of this ScheduleSheetInstance is a titleblock revision schedule or a sheet specific schedule.
Since:
2022.1

Autodesk.Revit.DB.ScheduleSheetInstance.Point
Location on the sheet where the ScheduleInstance is placed (in sheet coordinates).
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
When setting this property: This operation is prohibited for ScheduleInstances associated with revision schedules in titleblocks.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance.ScheduleId
Id of the primary schedule that generates this ScheduleInstance.
Since:
2013

Autodesk.Revit.DB.ScheduleSheetInstance
An element that represents a particular placement of a schedule on a sheet.
Remarks:
Use ScheduleSheetInstance.OwnerViewId to find the sheet on which a schedule is placed.
When a schedule is set to filter by sheet and placed on a sheet, it will create a new schedule with elements visible
in the Viewport(s) on that sheet. The instance created belongs to the newly created schedule.
Since:
2013